# Introduction to Pandas Lab

Complete the following set of exercises to solidify your knowledge of Pandas fundamentals.

### 1. Import Numpy and Pandas and alias them to `np` and `pd` respectively.

In [1]:
import pandas as pd
import numpy as np

### 2. Create a Pandas Series containing the elements of the list below.

In [3]:
lst = [5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]

In [4]:
series = pd.Series(lst)
print(series)

0     5.7
1    75.2
2    74.4
3    84.0
4    66.5
5    66.3
6    55.8
7    75.7
8    29.1
9    43.7
dtype: float64

### 3. Use indexing to return the third value in the Series above.

*Hint: Remember that indexing begins at 0.*

In [95]:
print(f"The third value of the series is: {series[2]}")

The third value of the series is: 74.4

### 4. Create a Pandas DataFrame from the list of lists below. Each sublist should be represented as a row.

In [8]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [11]:
b_df = pd.DataFrame(b)   #creates the dataframe b_df
b_df

      0     1     2     3     4
0  53.1  95.0  67.5  35.0  78.4
1  61.3  40.8  30.8  37.8  87.6
2  20.6  73.2  44.2  14.6  91.8
3  57.4   0.1  96.1   4.2  69.5
4  83.6  20.5  85.4  22.8  35.9
5  49.0  69.0   0.1  31.8  89.1
6  23.3  40.7  95.0  83.8  26.9
7  27.6  26.4  53.8  88.8  68.5
8  96.6  96.4  53.4  72.4  50.1
9  73.7  39.0  43.2  81.6  34.7

### 5. Rename the data frame columns based on the names in the list below.

In [15]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [22]:
b_df = b_df.rename(columns ={'0':'Score 0', '1':'Score 1', '2':'Score 2', '3':'Score 3', '4':'Score 4'}) 
b_df

   Score 0  Score 1  Score 2  Score 3  Score 4
0     53.1     95.0     67.5     35.0     78.4
1     61.3     40.8     30.8     37.8     87.6
2     20.6     73.2     44.2     14.6     91.8
3     57.4      0.1     96.1      4.2     69.5
4     83.6     20.5     85.4     22.8     35.9
5     49.0     69.0      0.1     31.8     89.1
6     23.3     40.7     95.0     83.8     26.9
7     27.6     26.4     53.8     88.8     68.5
8     96.6     96.4     53.4     72.4     50.1
9     73.7     39.0     43.2     81.6     34.7

### 6. Create a subset of this data frame that contains only the Score 1, 3, and 5 columns.

In [30]:
subset_scores = b_df[['Score 1','Score 3','Score 4']]
subset_scores

   Score 1  Score 3  Score 4
0     95.0     35.0     78.4
1     40.8     37.8     87.6
2     73.2     14.6     91.8
3      0.1      4.2     69.5
4     20.5     22.8     35.9
5     69.0     31.8     89.1
6     40.7     83.8     26.9
7     26.4     88.8     68.5
8     96.4     72.4     50.1
9     39.0     81.6     34.7

### 7. From the original data frame, calculate the average Score_3 value.

In [99]:
average_score = b_df["Score 3"].mean()
print(f"The average for Score 3 is: {average_score}")

The average for Score 3 is: 47.279999999999994

### 8. From the original data frame, calculate the maximum Score_4 value.

In [100]:
max_score = b_df["Score 4"].max()
print(f"The max for Score 4 is: {max_score}")

The max for Score 4 is: 91.8

### 9. From the original data frame, calculate the median Score 2 value.

In [98]:
median_score = b_df["Score 2"].median()
print(f"The median for Score 2 is: {median_score}")

The median for Score 2 is: 53.599999999999994

### 10. Create a Pandas DataFrame from the dictionary of product orders below.

In [45]:
orders = {'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [46]:
df = pd.DataFrame(orders)
df

                          Description  Quantity  UnitPrice  Revenue
0              LUNCH BAG APPLE DESIGN         1       1.65     1.65
1  SET OF 60 VINTAGE LEAF CAKE CASES         24       0.55    13.20
2         RIBBON REEL STRIPES DESIGN          1       1.65     1.65
3   WORLD WAR 2 GLIDERS ASSTD DESIGNS      2880       0.18   518.40
4    PLAYING CARDS JUBILEE UNION JACK         2       1.25     2.50
5                      POPCORN HOLDER         7       0.85     5.95
6      BOX OF VINTAGE ALPHABET BLOCKS         1      11.95    11.95
7                       PARTY BUNTING         4       4.95    19.80
8            JAZZ HEARTS ADDRESS BOOK        10       0.19     1.90
9       SET OF 4 SANTA PLACE SETTINGS        48       1.25    60.00

### 11. Calculate the total quantity ordered and revenue generated from these orders.

In [49]:
total_quantity = df['Quantity'].sum()
revenue = df['Revenue'].sum()

print(f"A total of {total_quantity} units have been ordered with a generated revenue of {revenue}.")

A total of 2978 units have been ordered with a generated revenue of 637.0.

### 12. Obtain the prices of the most expensive and least expensive items ordered and print the difference.

In [102]:
most_expensive_row = df.loc[df["UnitPrice"].idxmax()]
least_expensive_row = df.loc[df["UnitPrice"].idxmin()]

most_expensive = most_expensive_row["UnitPrice"]
least_expensive = least_expensive_row["UnitPrice"]

difference = most_expensive - least_expensive

print(f"The least expensive item is {least_expensive}")
print(f"The most expensive item is {most_expensive}")
print(f"The difference between the most expensive and the least expensive is: {difference}")

The least expensive item is 0.18
The most expensive item is 11.95
The difference between the most expensive and the least expensive is: 11.77

## Let's load another dataset for more exercisesÂº

In [62]:
# Run this code:
admissions = pd.read_csv('../Admission_Predict.csv')

Let's evaluate the dataset by looking at the `head` function.

In [65]:
admissions.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,316,104,3,3.0,3.5,8.00,1,0.72
2,3,322,110,3,3.5,2.5,8.67,1,0.80
3,4,314,103,2,2.0,3.0,8.21,0,0.65
4,5,330,115,5,4.5,3.0,9.34,1,0.90

### 1 - Before beginning to work with this dataset and evaluating graduate admissions data, we will verify that there is no missing data in the dataset. Do this in the cell below.

In [110]:
print(admissions.isnull().sum())  #isnull() function detects missing values and sums the number of

GRE Score            0
TOEFL Score          0
University Rating    0
SOP                  0
LOR                  0
CGPA                 0
Research             0
Chance of Admit      0
dtype: int64

###  2 -  Interestingly, there is a column that uniquely identifies the applicants. This column is the serial number column. Instead of having our own index, we should make this column our index. Do this in the cell below. Keep the column in the dataframe in addition to making it an index.

In [67]:
admissions = admissions.set_index('Serial No.')
admissions.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,316,104,3,3.0,3.5,8.00,1,0.72
3,322,110,3,3.5,2.5,8.67,1,0.80
4,314,103,2,2.0,3.0,8.21,0,0.65
5,330,115,5,4.5,3.0,9.34,1,0.90

Turns out that `GRE Score` and `CGPA` also uniquely identify the data. Show this in the cell below.

In [122]:

duplicates = admissions.duplicated(subset=["GRE Score", "CGPA"]) ##checks if there are duplicate values on GRE Score and CGPA

duplicate_rows = admissions[duplicates] #filters the original dataframe to show the duplicated values

print("The GRE Score and CGPA columns have unique values, as seen below, so both could be used as index") 

duplicate_rows  #prints the rows that are duplicated

The GRE Score and CGPA columns have no duplicate numbers, as seen below, so both could be used as index

Empty DataFrame
Columns: [GRE Score, TOEFL Score, University Rating, SOP, LOR , CGPA, Research, Chance of Admit ]
Index: []

### 3 - In this part of the lab, we would like to test complex conditions on the entire data set at once. Let's start by finding the number of rows where the CGPA is greater than 9 and the student has performed an investigation.

In [123]:
cgpa_rows = admissions[admissions.CGPA > 9] #filters the rows by the condition CGPA > 9
SOP_rows = cgpa_rows[cgpa_rows.Research > 0] #filters the rows by the condition Research > 0
print(f"The total of students with a CGPA higher than 9 and with at least one research are: {SOP_rows.shape[0]}")   # prints the number of rows of the filtered dataframe

The total of students with a CGPA higher than 9 and with at least one research are: 101

### 4 - Now return all the rows where the CGPA is greater than 9 and the SOP score is less than 3.5. Find the mean chance of admit for these applicants.

In [124]:
new_admissions = admissions[(admissions['CGPA'] > 9) & (admissions['SOP'] < 3.5)]
chance_of_admit_mean = new_admissions['Chance of Admit '].mean()
print(f"The mean chance of admit for these students is: {chance_of_admit_mean}")

The mean chance of admit for these students is: 0.8019999999999999